{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"page_breadcrumb_DxFGcp":{"type":"page-breadcrumb","settings":{"show_page_title":true,"show_breadcumb_title":true,"show_resources":true,"padding_top_desktop":"40px","padding_bottom_desktop":"40px","padding_top_mobile":"20px","padding_bottom_mobile":"20px"}},"paragraph_with_logos_pwdcV6":{"type":"paragraph-with-logos","blocks":{"logos_tEYVLx":{"type":"logos","settings":{"image":"shopify:\/\/shop_images\/ace_1_cd423f45-0784-4c7d-9340-002dc0677273.png"}},"logos_HqkLne":{"type":"logos","settings":{"image":"shopify:\/\/shop_images\/ace_2_1249312e-0002-4fce-bcce-ba2e0b30108e.png"}},"logos_gnxzdm":{"type":"logos","settings":{"image":"shopify:\/\/shop_images\/ace_5_494e0f05-8123-4d7c-9f31-79b2da4b6c86.png"}},"logos_CHPV47":{"type":"logos","settings":{"image":"shopify:\/\/shop_images\/ace_7_c8a28b99-8add-426e-8f06-5e89b95367c6.png"}},"logos_pVgtTH":{"type":"logos","settings":{"image":"shopify:\/\/shop_images\/ace_8_bf0bd90e-959b-4b82-ab9e-d4ab5751aed9.png"}},"logos_iXNWWm":{"type":"logos","settings":{"image":"shopify:\/\/shop_images\/ace_10_90059742-aff1-4eab-9c40-7ec6ba4c49c0.png"}},"logos_W94pPD":{"type":"logos","settings":{"image":"shopify:\/\/shop_images\/ace_12_8a7c8db7-16ab-428e-b41b-7884aca07cdf.png"}},"logos_MHz8td":{"type":"logos","settings":{"image":"shopify:\/\/shop_images\/ace_14_2a081301-1a06-4f55-b58f-34801d8e0bda.png"}}},"block_order":["logos_tEYVLx","logos_HqkLne","logos_gnxzdm","logos_CHPV47","logos_pVgtTH","logos_iXNWWm","logos_W94pPD","logos_MHz8td"],"settings":{"description":"<p>Protective gears designed and tested to the highest standards to keep your workers safe on the job, offering one of the most extensive line of protective workwear and safety equipment for any industry. A one-stop solution for a wide range of accessories and equipment for all of your safety needs.Committed to providing its customers with the highest quality products and services, our processes follow and adhere to some of the highest standards in the personal protective equipment manufacturing industry.<\/p><p>Our products are manufactured as per ANSI & EN specifications for head, hand, eye, and other protective equipment. Our high-vis safety apparel is perfect for any work environment, offering high visibility, maximum comfort, and excellent protection. We strive to create safety equipment that is comfortable to wear, offering maximum visibility and style without sacrificing protection.<\/p>","padding_top_desktop":"0px","padding_bottom_desktop":"40px","padding_top_mobile":"0px","padding_bottom_mobile":"20px"}},"safety_standards_FCHpjf":{"type":"safety-standards","blocks":{"hand_protection_KqJWJH":{"type":"hand-protection","settings":{"heading":"Hand Protection","description":"<h3>EN - European Norm<\/h3><h4>All our hand gloves are EN 388 & EN 407 Regulatory Standards approved<\/h4><p>EN is the European standard used to evaluate mechanical risks for hand protection. It is an internationally benchmarked standard for the testing and certification of hand protection. It evaluates products against hand, glove, and arm protection, and provides guidance on minimum requirements for head, eye, and other protective equipment. It is a globally recognized standard that is used by safety professionals, industry, and government agencies to ensure the safest possible workplace.<\/p>","image":"shopify:\/\/shop_images\/Image_afc1aab2-c563-4c50-943f-725f4f4cfd2c.png","image1":"shopify:\/\/shop_images\/Image_ef126fbe-165e-40da-b277-70d0982262b0.png","image2":"shopify:\/\/shop_images\/Image-1_58788924-3f1d-4f98-a292-ca5273240349.png","image3":"shopify:\/\/shop_images\/Image_8ae2a48c-5bab-4973-bbb2-33a4d96ce6aa.png","heading1":"Cut Resistant Gloves","description1":"<h3>ANSI & ISEA Standards\u2028For Cut Resistant Gloves<\/h3><p>Protecting yourself from cuts and other injuries is mandatory when working with dangerous materials. Caco America cut resistant gloves are designed to protect you from these hazards, and are certified to meet ANSI and ISEA standards for cut resistance.<\/p><p>Caco America cut resistant gloves are built and certified for cut resistance from A1 to A9.<\/p>","image4":"shopify:\/\/shop_images\/26.png","heading2":"Impact Resistant Hand Gloves","description2":"<h3>ANSI\/ISEA 138-2019 Standards For Measuring Impact Resistance Of\u2028Hand Gloves<\/h3><p>This standard is used to evaluate the impact resistance and protection of gloves. It specifies the requirements for gloves designed to protect the knuckles and fingers of the hand from direct impact from external objects. Impact resistance is classified into three levels: 1, 2, and 3, with level 1 representing the lowest level of performance and level 3 representing the highest level of performance.<\/p>","image5":"shopify:\/\/shop_images\/Image_cdb6c691-7dfe-4d55-86c9-c22e977b3850.png","image6":"shopify:\/\/shop_images\/Image_237bd3e3-fa74-41a2-8007-a92a68a256b5.png","description3":"<h4>EN388 Regulatory Standard<\/h4><p>This standard is used to evaluate mechanical risks for hand protection, but a glovemust be EN 388 certified in order to be legally sold in Europe. Gloves with an EN 388 rating must be tested by a third party and can be rated for abrasion, cut, tear, and puncture resistance.<\/p>","image7":"shopify:\/\/shop_images\/Image_509d4652-ba8e-4cd7-8422-adbccd3037da.png","description4":"<h4>ANSI\/ISEA 138-2019 Testing Process<\/h4><p>The impact protection of the gloves is measured using the ANSI\/ISEA 138-2015 standard, working from the area of the knuckles to the fingers.<\/p><p>The testing area for the little and middle fingers is 5 cm from the fingertip. The testing area on the thumb, ring, and index fingers is 2.5 cm from the fingertip.<\/p>","image8":"shopify:\/\/shop_images\/Image-1_08751967-c7b1-480c-8be3-1da7c2e2eac3.png","description5":"<h4>TPR Layers<\/h4><p>Our TPR gloves feature 3 layers of thick, 6 mm TPR that resists impact without injuring your hand, highly durable stitching, and are made of 100% genuine or premium synthetic leather. They are designed to provide excellent impact protection.<\/p>","heading3":"Reusable Gloves","image9":"shopify:\/\/shop_images\/Image_8b3ce237-21c7-4941-81ee-e7dc50f133a3.png","description6":"<h4>EN 374 Regulatory Standards\u2028For Reusable Gloves<\/h4><p>The European standard EN 374 is used to assess the needs for gloves that protect against dangerous liquids, chemicals, and microorganisms. This standard measures the rate at which various chemicals degrade and permeate gloves.<\/p><p>Our gloves are built to protect your hands from basic and specific hazards. They are also highly effective in preventing the effects & damages caused by micro-organisms.Our gloves adhere to standard levels of:<\/p>","description7":"<ul><li><strong>EN 374-1<\/strong> Defines the terms used in the standard and specifies the requirements for protection against chemicals and microorganisms.<\/li><li><strong>EN 374-2<\/strong> Defines and specifies a test procedure forgloves that protect against chemicals and\/or microorganisms in terms of penetration resistance.<\/li><li><strong>EN 374-3 <\/strong>Defines the method for assessing a glove's resistance to potentially dangerous, nongaseous chemical permeation under repeated contact conditions.<\/li><\/ul>"}},"protective_clothing_3HPaX9":{"type":"protective-clothing","settings":{"heading":"Protective Clothing","description":"<h4>Certified Under The\u2028ANSI 107-2020 Standards<\/h4><p>The American National Standards Institute (ANSI) offers this certification to ensure that specific guidelines are followed when creating high visibility apparel, when selecting it, and when utilizing each type of high visibility apparel for the intended applications.<\/p>","image":"shopify:\/\/shop_images\/Image-1_2219192a-6845-4849-b468-36dbf54e4dee.png","image1":"shopify:\/\/shop_images\/Image_5cdae8b6-7515-42f9-92a5-aa038e45da0d.png","heading1":"Class & Types","description1":"<ul><li><strong>Type-0<\/strong> Has been created for use in work environments without heavy machinery, complex viewing environments, or locations close to any type of high-speed road. It offers a moderate level of visualization.<\/li><li><strong>Class-3<\/strong> High visibility in all directions is provided for workers who are in areas that are prone to accidents, such as on fast roads (traveling at speeds over 50 mph). maximum body coverage, long-range visibility, and visibility in low light.<\/li><li><strong>Class-2 <\/strong>Providing 360-degree high visibility for workers who are in areas that are prone to accidents, such as high-speed roads (below 50 mph).<\/li><\/ul>","description2":"<ul><li><strong>Class-1<\/strong> Intended for employees who work in low-risk areas, i.e., away from roads and complex work environments<\/li><li><strong>Type-R <\/strong>It is made for use in daytime and night time environments, in visually complex workplaces, and is ideal for use in close-by high-speed machinery and road work. It is designed to provide high visibility.<\/li><li><strong>Class-E <\/strong>Class E, which consists of additional clothing to increase the worker's visibility, such as reflective pants, high visibility jackets, or rain pants, does not fit into the numbering system. It will be deemed class 3 attire if a class E garment is added (for example, high visibility pants) and the worker is wearing a class 2 safety vest. If the worker is wearing a class 1 safety vest and a class E garment is added, it will be deemed class 2 attire.<\/li><\/ul>","heading2":"Protective Coveralls","description3":"<p>Protective coveralls are widely used in many industries, and the safety of employees depends on the equipment being used. Each type of protective equipment requires a different kind of certification to ensure it meets safety standards. Every piece of protective equipment requires certifications to meet safety standards, but each has its own unique set of requirements.<\/p>","image2":"shopify:\/\/shop_images\/Image_3d495077-f045-4679-8130-19d01802be53.png","description4":"<ul><li><strong>EN 14605 - Type 3 <\/strong>Protective clothing for the entire body (trunk, arms, and legs), Guards against a direct or pressurized jet of liquid chemicals.<\/li><li><strong>EN 14605 - Type 5<\/strong> Protective clothing for the entire body (trunk, arms, and legs) only applies to airborne solid particles; liquid chemicals and specific solid products in the form of dust should not be worn with this clothing.<\/li><li><strong>EN 1073-2<\/strong> Protective clothing against contamination with radioactive particulates.<\/li><li><strong>EN 14126 <\/strong>Protective clothing against infectious agents.<\/li><\/ul>","description5":"<ul><li><strong>EN 14605 - Type 4 <\/strong>Protective clothing for the entire body, including the arms, legs, and trunk, guards against saturated chemical splashes.<\/li><li><strong>EN 13034:2005 - Type 6 <\/strong>Protective clothing for the entire body, including the arms, legs, and trunk, guards against a fine mist of liquid chemicals.<\/li><li><strong>EN 1073-2 <\/strong>Electrostatically resistant protective clothing.<\/li><\/ul>","heading3":"Protective Coveralls – Materials","image3":"shopify:\/\/shop_images\/Image_5c9bd494-6ae7-404d-8f4e-534bfddcd65c.png","image4":"shopify:\/\/shop_images\/Image-1_a1375a2a-0288-4bc9-bb23-217ed4c25a07.png","description6":"<h4>SMS (Spunbound, Meltblown, Spunbound)<\/h4><p>This kind of nonwoven fabric, which combines spunbond and meltblown fabrics, is effective at repelling liquids.<\/p>","description7":"<h4>Microporous<\/h4><p>Provides excellent protection against non-hazardous liquids while also allowing the body to breathe in hot working environments, providing comfort.<\/p>"}},"protective_eyewear_PfMXwh":{"type":"protective-eyewear","settings":{"heading":"Protective Eyewear\u2028Glasses & Goggles","description":"","image":"shopify:\/\/shop_images\/Image_c51dc862-0ead-4f45-80d5-98c41be8aac2.png","image1":"shopify:\/\/shop_images\/ace_10_1c17923d-4524-46e6-a912-163c8e36aa96.png","heading1":"EN 166:2001","description1":"<p>En 166:2001, a specification based on European specification standards, details the guidelines or fundamental requirements for eyewear protection.<\/p>","image2":"shopify:\/\/shop_images\/ace_10-1.png","heading2":"ANSI 107-2020","description2":"<p>The standards and recommendations for eyewear protection are referenced in Z87.1 ANSI. stating that the product complies with all requirements and offers the wearer the necessary defense against liquid splashes, small object impacts, and dust.<\/p>","image3":"shopify:\/\/shop_images\/ace_10-2.png","heading3":"CE","description3":"<p>Based on European specification standards, EN 166:2001 specifies the guidelines or fundamental requirements for eyewear protection.<\/p>"}},"hearing_protection_xCYxey":{"type":"hearing-protection","settings":{"heading":"Hearing Protection","description":"<h3>NRR & ANSI S3.19-1974 Standards<\/h3><p>The noise-reduction capabilities of hearing protection devices are measured by the Noise Reduction Rating (NRR), which has been chosen by the U.S. Environmental Protection Agency (EPA).<\/p><p>The difference between the A-weighted environmental noise level and the NRR closely approximates the amount of noise that enters a person's ear when a hearing protector is worn as instructed.<\/p>","image":"shopify:\/\/shop_images\/Image_490ecfa0-e912-4793-994f-a6646785e06a.png","description1":"<p>Example:<\/p><ol><li>The ambient noise level measured at the ear is 92 decibels (A).<\/li><li>The NRR is set at 23 decibels (dB).<\/li><li>The noise level entering the ear is roughly equal to [92-26 dB(A)] 66 dB. (A).<\/li><\/ol><p>The C-Weighted environmental noise level should be used for noise environments where frequencies under 500 Hz predominate. The NRR used in the aforementioned example was attained in a lab setting.<\/p><p>Make sure you select hearing protection that has the dB level you need to avoid hearing damage when making your selection.<\/p>","image1":"shopify:\/\/shop_images\/Image-1_a9c9503c-fd9d-4e79-95f7-9a1a533347c4.png","description2":"<h3>ANSI S3.10-1974 Standard\u2028For Different Sound Levels<\/h3><p>This standard must be met by hearing protection equipment in order to be certified as protecting against different noise levels. Before the model can be sold with the NRR label, all products must pass rigorous quality and standards tests at authorized locations.<\/p>","image2":"shopify:\/\/shop_images\/Image-2_ba741945-9088-4ac1-a73f-3c6e2174d529.png"}},"ergonomics_bdd83E":{"type":"ergonomics","settings":{"heading":"Ergonomics","description":"<h3>EN Standards Explained\u2028For Ergonomic Knee Pads<\/h3><h4>EN 14404<\/h4><p>For all occupations requiring kneeling work, it is important to wear knee protection\u2028when working for extended periods of time in this position as it can cause long-term discomfort, discomfort, and even some kind of injury. This standard evaluates the performance and type levels of knee protection.<\/p>","image":"shopify:\/\/shop_images\/Image_7519830b-fca5-4395-aef6-97412e304adf.png","image1":"shopify:\/\/shop_images\/Frame_4944c6c1-0f28-4114-ab99-c1c792d4fb97.png","heading1":"Type1:","description1":"<p>Knee guards that are attached around the leg and are not a part of any clothing.<\/p>","image2":"shopify:\/\/shop_images\/Frame-5.png","heading2":"Type2:","description2":"<p>Plastic foam inserted into a pair of pants' leg reinforcements.<\/p>","image3":"shopify:\/\/shop_images\/Frame-2.png","heading3":"Type3:","description3":"<p>Equipment that is placed when the user moves but is not anchored to the body.<\/p>","image4":"shopify:\/\/shop_images\/Frame-3.png","heading4":"Type4:","description4":"<p>Extra-functional accessories that make it easier to stand up or bend over.<\/p>","heading5":"Class 0","description5":"<p>Recommended for flat floors that don’t require penetration resistance.<\/p>","image5":"shopify:\/\/shop_images\/Frame_da1e9c01-4f47-4e76-a8dc-438ee2b6d340.png","heading6":"Class 1","description6":"<p>Recommended for flat floors that require penetration resistance of up to 100N.<\/p>","image6":"shopify:\/\/shop_images\/Frame_4944c6c1-0f28-4114-ab99-c1c792d4fb97.png","heading7":"Class 2","description7":"<p>Recommended for flat floors that require penetration resistance of up to 250N<\/p>","image7":"shopify:\/\/shop_images\/Frame-5.png"}}},"block_order":["hand_protection_KqJWJH","protective_clothing_3HPaX9","protective_eyewear_PfMXwh","hearing_protection_xCYxey","ergonomics_bdd83E"],"settings":{"padding_top_desktop":"0px","padding_bottom_desktop":"40px","padding_top_mobile":"0px","padding_bottom_mobile":"20px"}}},"order":["main","page_breadcrumb_DxFGcp","paragraph_with_logos_pwdcV6","safety_standards_FCHpjf"]}