{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"page_breadcrumb_nbBRrw":{"type":"page-breadcrumb","settings":{"show_page_title":true,"show_breadcumb_title":true,"show_resources":true,"padding_top_desktop":"40px","padding_bottom_desktop":"40px","padding_top_mobile":"20px","padding_bottom_mobile":"20px"}},"paragraph_with_logos_RPcWfa":{"type":"paragraph-with-logos","settings":{"description":"<p>Our range of Personal Protective Equipment (PPE) is designed with varied materials that offer highest safety and comfort to the wearer. The materials also provide unique applications based on the nature of the work. They are also available in different sizes and colors to meet the requirements of the client.<\/p>","padding_top_desktop":"0px","padding_bottom_desktop":"0px","padding_top_mobile":"0px","padding_bottom_mobile":"0px"}},"ppe_material_wHT6yc":{"type":"ppe-material","blocks":{"gloves_dgXaUC":{"type":"gloves","settings":{"image":"shopify:\/\/shop_images\/Image_0a8cf095-d6d2-4293-a3bd-fce402392acd.png","heading":"Dipped Gloves","description":"<h4>Nitrile<\/h4><ul><li>Long-lasting material with excellent puncture and tear resistance.<\/li><li>Primarily suitable for oily and wet conditions because nitrile allows liquids to pass quickly through the glove without losing grip and dexterity<\/li><li>Aids better performance in different temperatures<\/li><\/ul><h4>Polyurethane<\/h4><ul><li>Offers increased flexibility and dexterity.<\/li><li>A lighter and more breathable material, offers excellent grip without being too sticky.<\/li><li>Suitable for light duty jobs, small parts handling, and light manufacturing.<\/li><\/ul><h4>Latex<\/h4><ul><li>Offers superior elasticity, durability, and dexterity.<\/li><li>Excellent choice for wet or dry applications due to its material; doesn’t work well with oily or abrasive materials.<\/li><\/ul>"}},"gloves_xcL9DC":{"type":"gloves","settings":{"image":"shopify:\/\/shop_images\/Image-1_515d1813-61b5-42fa-82bb-2a154eee2de2.png","heading":"Leather Gloves","description":"<p>Cowhide leather is the most common leather type used to create leather gloves. Leather gloves are primarily used for welding, driving, and palm protection<\/p><h4>Cow Grain Leather<\/h4><ul><li>The hide's outer layer is naturally water repellent and extremely durable in volatile conditions. Cow grain leather is the thickest and most durable leather available.<\/li><\/ul><h4>Cow Split Leather<\/h4><ul><li>This is the hide's bottom layer. It is more abrasion and heat resistant. Additionally, it provides a smoother texture and greater flexibility.<\/li><\/ul>"}},"gloves_LFj4KE":{"type":"gloves","settings":{"image":"shopify:\/\/shop_images\/Image-2_45f7a911-cb0d-4b35-80fb-7e16ee1e0691.png","heading":"Mechanics Gloves","description":"<p>These are heavy-duty gloves used to protect your hands from impact and puncture. They’re commonly made with TPR (thermoplastic rubber), with a lining of natural or synthetic leather. They are often used by mechanics, machinists, and heavy equipment operators.<\/p><p>Our TPR gloves are made of 3 layers of thick TPR that repels impact without damaging your hand, are made of 6 mm TPR, have highly durable stitching, and are made of 100% natural or high-quality synthetic leather.<\/p>"}},"gloves_q4jCAm":{"type":"gloves","settings":{"image":"shopify:\/\/shop_images\/Image-3.png","heading":"Reusable Gloves","description":"<p>Latex and neoprene are the primary materials used to make reusable gloves. Latex is a rubber-like material produced from the sap of certain plants. It is commonly found in household items such as rubber bands and condoms. Neoprene is a synthetic rubber that is similar to latex but is a little stretchier and better at insulating the hand. Latex-free nitrile reusable gloves are also available. These are made from a synthetic rubber material that is similar to latex but is a little stretchier and better at insulating the hand. They are generally cheaper than latex reusable, but require washing before use. Like latex reusable, they can be used multiple times without needing to be thrown away.<\/p>"}},"protective_coveralls_pkbgLh":{"type":"protective-coveralls","settings":{"image":"shopify:\/\/shop_images\/Image_04d3c069-f8f7-4959-bdfb-c964c4be805d.png","heading":"Protective Coveralls","description":"<p>The first thing you notice when you put on a pair of Protective Coveralls is how breathable and protective they are at the same time. They’re made of a polyurethane stretch material that feels soft and supple against your skin yet is durable enough to keep you safe from dirt and debris on the job site. They also feature a range of durable, specialized fabrics for added protection and comfort, including a flame-resistant fabric for extra safety when working with hot equipment. The built-in, moisture-wicking liner keeps you cool and comfortable as you work, while the built-in neck gusset keeps dirt and debris out of your way.<\/p>"}},"sms_spunbound_meltbound_VykgKM":{"type":"sms-spunbound-meltbound","settings":{"image":"shopify:\/\/shop_images\/Image-1_991df7d8-da9a-4380-b53f-5fbc7fb5c1dd.png","heading":"SMS (Spunbound, Meltbound, Spunbound)","description":"<p>Spunbound is a premium spunbond fabric that is soft and breathable. It also offers superior resistance to heat, oil, and chemicals. The meltbound fabric is a blend of polyester and elastane that offers soft comfort and is resistant to moisture.<\/p>"}},"microporous_iiVx98":{"type":"microporous","settings":{"image":"shopify:\/\/shop_images\/Image-2_e93bb1f1-7302-42aa-8fff-3f539553551e.png","heading":"Microporous","description":"<p>Microporous materials are a series of extremely small holes or channels in the fabric. They are great for keeping you cool in hot environments and allowing sweat to escape so that you stay dry. They also make a great insulator, which is great for keeping you warm in cold environments.<\/p>"}}},"block_order":["gloves_dgXaUC","gloves_xcL9DC","gloves_LFj4KE","gloves_q4jCAm","protective_coveralls_pkbgLh","sms_spunbound_meltbound_VykgKM","microporous_iiVx98"],"settings":{"categories":"Gloves|Protective Coveralls|SMS (Spunbound, Meltbound, Spunbound)|Microporous","padding_top_desktop":"80px","padding_bottom_desktop":"80px","padding_top_mobile":"40px","padding_bottom_mobile":"40px"}}},"order":["main","page_breadcrumb_nbBRrw","paragraph_with_logos_RPcWfa","ppe_material_wHT6yc"]}